app/controllers/galleries_controller.rb

  def index
    @galleries = Gallery.all
---
SELECT * FROM `galleries`

  def index2
    if user_signed_in?
      if current_user.nickname=="Khin"
        @galleries = Gallery.all
---
SELECT * FROM `galleries`

  def show2
    if user_signed_in?
      if current_user.nickname=="Khin"
        @gallery = Gallery.find(params[:id])
---
SELECT * FROM `galleries` WHERE (`galleries`.`id` = 1)

  def show
    @gallery = Gallery.find(params[:id])
---
SELECT * FROM `galleries` WHERE (`galleries`.`id` = 1)

  def edit
    if user_signed_in?
      if current_user.nickname=="Khin"
        @gallery = Gallery.find(params[:id])
---
SELECT * FROM `galleries` WHERE (`galleries`.`id` = 'Testssss') LIMIT 1

  def create
    if user_signed_in?
      if current_user.nickname=="Khin"
        @gallery = Gallery.new(params[:gallery])

        respond_to do |format|
          if @gallery.save
---
INSERT INTO `galleries` (`updated_at`, `desc`, `presimage`, `activate`, `created_at`, `name`) VALUES('2013-06-09 10:29:55', 'Badoum Tsss', '', 1, '2013-06-09 10:29:55', 'Test 2')

  def update
    if user_signed_in?
      if current_user.nickname=="Khin"
        @gallery = Gallery.find(params[:id])

        respond_to do |format|
          if @gallery.update_attributes(params[:gallery])
---
SELECT * FROM `galleries` WHERE (`galleries`.`id` = '2') LIMIT 1
UPDATE `galleries` SET `desc` = 'Badoum Tsss', `updated_at` = '2013-06-09 20:39:50', `activate` = 1 WHERE `id` = 2