app/controllers/pictures_controller.rb

  def index
    @pictures = Picture.all
---
SELECT * FROM `pictures`

  def index2
    if user_signed_in?
      if current_user.nickname=="Khin"
        @pictures = Picture.all
---
SELECT * FROM `pictures`

  def show
    @picture = Picture.find(params[:id])
---
SELECT * FROM `pictures` WHERE (`pictures`.`id` = 0)

  def edit
    if user_signed_in?
      if current_user.nickname=="Khin"
        @picture = Picture.find(params[:id])
---
SELECT * FROM `pictures` WHERE (`pictures`.`id` = 4)

  def destroy
    if user_signed_in?
      if current_user.nickname=="Khin"
        @picture = Picture.find(params[:id])
        @picture.destroy
---
SELECT * FROM `pictures` WHERE (`pictures`.`id` = 2)
DELETE FROM `pictures` WHERE `id` = 2