app/controllers/upload_controller.rb

  def uploadFile
    if user_signed_in?
      if current_user.nickname=="Khin"
        post = DataFile.save(params[:upload], params[:gallery], params[:pictures])
---
INSERT INTO `pictures` (`path`, `created_at`, `updated_at`, `activate`, `desc`, `gallery_id`, `name`) VALUES('/upload/data/maddycompromise.png', '2013-06-10 20:42:41', '2013-06-10 20:42:41', 1, 'maddy compromise', 1, NULL)